Question 1: From given data set print first and last five rows

In [25]:
import pandas as pd
# I need to have these \\ instead of only 1 \
auto_data = pd.read_csv('C:\\Users\\krist\\Automobile_data.csv')
auto_data.head()

,index,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
0,0,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,13495.0
1,1,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,16500.0
2,2,alfa-romero,hatchback,94.5,171.2,ohcv,six,154,19,16500.0
3,3,audi,sedan,99.8,176.6,ohc,four,102,24,13950.0
4,4,audi,sedan,99.4,176.6,ohc,five,115,18,17450.0

In [6]:
auto_data.tail()

,index,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
56,81,volkswagen,sedan,97.3,171.7,ohc,four,85,27,7975.0
57,82,volkswagen,sedan,97.3,171.7,ohc,four,52,37,7995.0
58,86,volkswagen,sedan,97.3,171.7,ohc,four,100,26,9995.0
59,87,volvo,sedan,104.3,188.8,ohc,four,114,23,12940.0
60,88,volvo,wagon,104.3,188.8,ohc,four,114,23,13415.0

Question 2: Clean data and update the CSV file

In [8]:
auto_data.isnull().sum()

index               0
company             0
body-style          0
wheel-base          0
length              0
engine-type         0
num-of-cylinders    0
horsepower          0
average-mileage     0
price               3
dtype: int64

In [33]:
#auto_data['price']= auto_data['price'].fillna(0)
auto_data['price'].count()

58

Question 3: Find the most expensive car company name

In [54]:
print(auto_data.price.argmax())
print(auto_data.price.max())
print(auto_data.company[35])

35
45400.0
mercedes-benz

C:\Users\krist\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning:
The current behaviour of 'Series.argmax' is deprecated, use 'idxmax'
instead.
The behavior of 'argmax' will be corrected to return the positional
maximum in the future. For now, use 'series.values.argmax' or
'np.argmax(np.array(values))' to get the position of the maximum
row.
  """Entry point for launching an IPython kernel.

In [61]:
import pandas as pd
df = pd.read_csv('C:\\Users\\krist\\Automobile_data.csv')
df = df[['company','price','horsepower']][df.price==df.price.max()]
df

          company    price  horsepower
35  mercedes-benz  45400.0         184

In [62]:
df

          company    price  horsepower
35  mercedes-benz  45400.0         184